/*******************************************************************************
 *                   	       GPCNC
 *           The General-Purposed CNC Software Develop Environment
 *           (c) Copyright 2004-2013, Automation Depatment of NJIT
 *                         All Rights Reserved
 *
 *-----------------------文件信息-----------------------------------------------
 * 文件名: .c
 * 描  述:
 *
 * 创建人:
 * 版  本:
 * 日  期:
 *
 * 修改人:
 * 版  本:
 * 日　期:
 * 修改信息:
 *
 * 说明:
 *
 *...
 ******************************************************************************/

#include "var_init.h"

e6pos  XPOINT1 = {"XPOINT1",900,0,800,0,0,0,6,27,0,0,0,0,0,0};
e6pos  HOME    = {"XHOME"  ,0  ,0,0  ,0,0,0,0,0 ,0,0,0,0,0,0};
//pdat  PDEFAULT={"PDEFAULT",50,100,0,true};
